

/*
    17 июня
    TODO    Исправить ошибку в insert
    *       18 июня
    *       Решение - добавил переменные соответствующих типов, которые передают значение в узел
    //        insert(float)(height, 1.23f, 2);
    //        error: passing 'float' to parameter of incompatible type 'void *'

    TODO    Удаление узла по индексу и значению
    *       18 июня
    *       Pешение - новые макросы, и обычное переназначение указателей узлов
    //       Не забыть про освобождение памяти

    TODO    Более короткий перебор списка по индексу
    *       Pешение
    !       Сравнивать индекс с размером списка и выбирать направление движения
    !       с головы до хвоста или наоборот

    TODO    Попытаться исправить все предупреждения и проблемы
    *       Pешение
    !       warning = ∞
    !       проблем = 6
 */